Revit 2027 API
HVACLoadBuildingType.IsValidTime Method
 Check if the string can be parsed to a valid time for opening time and closing time. A valid string can be "16:30" or "4:30 PM";
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsValidTime(
	string hourMinute
)
Public Shared Function IsValidTime (
	hourMinute As String
) As Boolean
public:
static bool IsValidTime(
	String^ hourMinute
)
static member IsValidTime :
        hourMinute : string -> bool
Parameters
hourMinute String
Return Value
Boolean
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
HVACLoadBuildingType Class
Autodesk.Revit.DB.Analysis Namespace